Gloeidraad/ESP32-MUSIC-PLAYER/Software/ESP32-Music-Player/Player.cpp
// Remark:  Please check in "Hardware/Board.h" that:
// USE_SD_MMC is defined
// DAC_ID is set to DAC_ID_MAX98357A

#include "src/ChipInfo.h"
#include "src/Hardware/Board.h"
#include "esp_wifi.h"
#include "Display.h"
#include "SimpleWaveGenerator.h"
#include "Player.h"

#if ESP_IDF_VERSION_MAJOR == 5
#include "ESP_I2S.h" 
#endif

#define BT_ACTIVITY_TIMER   10  // in 10 ms slots

#define BLUETOOTH_VOLUME_MIN  24
#define BLUETOOTH_VOLUME_MAX  127

static void AudioDieOut(Audio * _audio, int loops = 100) {
  if(_audio == NULL) return;
  for(int i = 0; i < loops; i++) {
    uint64_t timestamp_us = esp_timer_get_time();
    while(esp_timer_get_time() < timestamp_us + 1000) { // every millisecond
      _audio->loop();
    }
  }
}

//******************************************************//
// Constructor                                          //
//******************************************************//

PlayerClass::PlayerClass() {
  _loop             = NULL;
  _audio            = NULL;
  _a2dp_sink        = NULL;
  _waveform_player  = NULL;
  _activity_counter = 0;
  _activity_sum     = 1;
  _connected        = false;
}

//******************************************************//
// SD Card Player                                       //
//******************************************************//

void PlayerClass::SD_PrintDebug(void) {
  if(_audio != NULL) {
    Serial.printf("getAudioCurrentTime : %d\n", _audio->getAudioCurrentTime());
    Serial.printf("getAudioFileDuration: %d\n", _audio->getAudioFileDuration());
    Serial.printf("getSampleRate       : %d\ngetBitsPerSample    : %d\n", _audio->getSampleRate(), _audio->getBitsPerSample());
    Serial.printf("getFileSize         : %d\ngetFilePos          : %d\n", _audio->getFileSize(), _audio->getFilePos());
    Serial.printf("getBitRate          : %d\n", _audio->getBitRate());
    Serial.printf("getChannels         : %d\n", _audio->getChannels());
  }
}

bool PlayerClass::PlayTrackFromSD(int n, uint32_t resume_pos, uint32_t resume_time, uint32_t track_time, uint32_t total_time) {
  _audio->stopSong();
  if(n == 0 || n > Settings.NV.DiskTotalTracks) {
    Serial.printf("Illegal track number: 0 < n < %d\n", Settings.NV.DiskTotalTracks + 1);
    return false;
  }
  String track(TrackSettings.GetTrackName(n));
  Serial.printf("Starting [%d]: \"%s\" at %d (%ds)\n", n, track.c_str(), resume_pos, resume_time);
  int i = track.lastIndexOf('.');        // Find the location of the file extension 
  if(i > 0) track[i] = '\0';             // Remove the extension
  Display.ShowTrackTitle(track.c_str()); // Show track without ".mp3" extension
  if(i > 0) track[i] = '.';              // Restore the extension
  #ifdef USE_SD_MMC
    _audio->connecttoFS(SD_MMC, track.c_str(), resume_pos);
  #else
    _audio->connecttoFS(SD, track.c_str(), resume_pos);
  #endif
  // Fix positioning if resume_pos fails (run until AudioCurrentTime is valid, then reposition if necessary)
  #if 1
  if(resume_time > 15) {
    uint32_t time  = millis();
    uint32_t cur, len;
    uint16_t ms100 = 0;
    while(ms100 < AUDIO_HEADER_TIMEOUT/100) { 
      _audio->loop();
      if(millis() > time + 100) {
        cur = _audio->getAudioCurrentTime();
        if(cur > 0) {
          len = _audio->getAudioFileDuration();
          Serial.printf("Resume found = %d/%d after %d00 ms\n", cur, len, ms100);
          break;
        }
        ms100++;
        time += 100;
      }
    }
    #if 0
    if(cur < resume_time - 15) { // 15 seconds off is accpetable
      while(millis() > time + 1000) // Run for another second
        _audio->loop();
      Serial.printf("Reposition %d to %d\n", cur, resume_time);
      _audio->setAudioPlayPosition(resume_time);
    }
    #endif
  }
  // end fix
  #endif
  Settings.AudioEnded             = 0;
  Settings.NV.DiskCurrentTrack    = n;
  Settings.NV.DiskTrackResumePos  = resume_pos;
  Settings.NV.DiskTrackResumeTime = resume_time;
  Settings.CurrentTrackTime       = resume_time; 
  Settings.TotalTrackTime         = track_time;  // Reset: Will be adjusted later, see loop()
  return true;
}

void PlayerClass::PositionEntry(void) {
  if(Settings.CurrentTrackTime == Settings.SeekTrackTime) {
    Serial.println("SD time not changed");
  }
  else {
    Serial.printf("SD time changed from %d to %d\n", Settings.CurrentTrackTime, Settings.SeekTrackTime);
    Settings.CurrentTrackTime = Settings.SeekTrackTime;
    _audio->setAudioPlayPosition(Settings.SeekTrackTime);
    Settings.NV.DiskTrackResumeTime = Settings.SeekTrackTime;
    //Settings.NV.DiskTrackResumePos  = _audio->getFilePos() - _audio->inBufferFilled();
    Display.ShowPlayTime(true); //OMT: new
  }
  
  if(Settings.Play)
    _audio->pauseResume(); // continue playing
}

//******************************************************//
// All Players                                          //
//******************************************************//

static void avrc_metadata_callback(uint8_t attribute, const uint8_t *data) {
  switch(attribute) {
    case 0x01: Serial.printf("AVRC metadata: title \"%s\"\n", data);
               Settings.CurrentTrackTime = -1; 
               Display.ShowTrackTitle(strlen((const char *)data) > 0 ? (const char *)data : (const char *)Settings.NV.BtName);
               break;
    default  : Serial.printf("AVRC metadata: 0x20  rsp: attribute id 0x%x, %s\n", attribute, data); break;
  }
}

static void bt_volumechange(int v) { 
  Serial.printf("bt_volumechange: %d\n",v);
  v = Player.CheckBluetoothVolume(v);
  for(int v2 = 1; v2 <= Settings.NV.VolumeSteps; v2++) {
    if(Settings.GetLinVolume(v2, BLUETOOTH_VOLUME_MAX) >= v) {
      Display.ShowVolume(v2, Settings.NV.VolumeSteps);
      return;
    }
  }
}

//static bool address_validator(esp_bd_addr_t remote_bda) { return true; }
//static void sample_rate_callback(uint16_t rate) { Serial.printf("sample_rate_callback: %d\n", rate); }
//static void rssi_callback(esp_bt_gap_cb_param_t::read_rssi_delta_param &rssi) { Serial.printf("rssi_callback\n"); }

void bt_raw_stream_reader(const uint8_t* pdata, uint32_t len) { 
  Player._activity_counter = BT_ACTIVITY_TIMER;  
  static int i = 0;
  if(len < 100) return; // Ignore small packets
  if(!(++i & 0xF)) { // We examine the data only once in 16 times, to save some processor performance
    const uint16_t *p = (const uint16_t *)pdata;
    uint32_t sum = 0; 
    for(int j = 0; j < len/2; j++) sum += *p++;
    Player._activity_sum = sum;
    #if 0
    //Serial.printf("%d ", len);
    //Serial.printf("%-2d", Player._activity_sum != 0);
    Serial.printf("%8d ", Player._activity_sum);
    if(!(i & 0xFF))
      Serial.println();
    #endif
  }
}

