Gloeidraad/ESP32-MUSIC-PLAYER/Software/ESP32-Music-Player/Player.cpp
static void bt_on_data_received(void) {
 // _activity_counter = BT_ACTIVITY_TIMER; 
  /*
  static int i = 0;
  Serial.print('d');
  if(++i == 64) {
    Serial.println();
    i = 0;
  }*/
}

void PlayerClass::NewSsid(void) {
  if(_audio != NULL && Settings.NV.SourceAF == SET_SOURCE_WEB_RADIO) {
    Stop();
    if(WiFi.status() == WL_CONNECTED)
      WiFi.disconnect();
    Start();
  }
}

void PlayerClass::Stop(void) { // Stop() must be followed by a reboot (or in the future perhaps Start())
  Serial.printf("Stopping player \"%s\"\n", Settings.GetSourceName(Settings.NV.SourceAF));
  if(_audio != NULL) { _audio->stopSong(); AudioDieOut(_audio); delete _audio; _audio = NULL; }
  if(_a2dp_sink != NULL) { _a2dp_sink->pause(); }  // Still need to pause BT, because it's a separate thread
  if(_waveform_player != NULL) _waveform_player->Pause();;
}

void PlayerClass::Start(bool autoplay) {
  Serial.printf("Initialize player \"%s\"\n", Settings.GetSourceName(Settings.NV.SourceAF));
  switch(Settings.NV.SourceAF) {
    case SET_SOURCE_SD_CARD    : if(Settings.NoCard || !TrackSettings.IsValid()) { 
                                   Display.ShowHelpLine("Loading Track List...", true);
                                   TrackSettings.LoadFromCard(true); // If previous session had no card, or after a soft restart.
                                 }
                                 else {
                                   #ifdef USE_SD_MMC
                                   if(!SD_MMC.begin( "/sdcard", true)) {
                                   #else
                                   if (!SD.begin(PIN_SPI_SS, SPI, SPI_SD_SPEED)) {
                                   #endif
                                     Serial.println("Card Mount Failed, Cannot play track");
                                     Display.ShowHelpLine(DISPLAY_HELP_NO_CARD, true);
                                     Settings.NoCard = 1;
                                     break;
                                   }
                                   Serial.println("Card Mount Succeeded");
                                   Settings.NoCard    = 0;
                                 }
                                 if(Settings.NoCard) { //
                                   Display.ShowHelpLine(DISPLAY_HELP_NO_CARD, true);
                                   Settings.Play = 0;
                                 }
                                 else if(Settings.NV.DiskTotalTracks == 0) {
                                   Display.ShowHelpLine(DISPLAY_HELP_NO_TRACKS_FOUND, true);
                                   Settings.Play = 0;
                                 }
                                 else {
                                   Display.ShowHelpLine(Settings.Play ? DISPLAY_HELP_NONE : DISPLAY_HELP_PRESS_PLAY_TO_START, true);
                                   Settings.FirstSong = 1;
                                   Settings.CurrentTrackTime = Settings.NV.DiskTrackResumeTime;
                                   Settings.TotalTrackTime   = Settings.NV.DiskTrackTotalTime;
                                 }
                                 _audio = new Audio;
                                 _audio->forceMono(Settings.NV.OutputFormat);
                                 _audio->setPinout(PIN_I2S_BCK, PIN_I2S_WS, PIN_I2S_DOUT);
                                 _audio->setHeaderTimeout(10000);  // Using OMT expansion
                                 #if DAC_ID == DAC_ID_PT8211
                                   _audio->setI2SCommFMT_LSB(true);
                                   _audio->setVolume(SET_VOLUME_MAX);
                                 #else
                                   _audio->setVolume(SET_VOLUME_DEFAULT);
                                 #endif
                                 break;
    case SET_SOURCE_BLUETOOTH  : Display.ShowHelpLine("Setting up Bluetooth");
                              #if ESP_IDF_VERSION_MAJOR == 5
                                 static I2SClass i2s;
                                 i2s.setPins(PIN_I2S_BCK, PIN_I2S_WS, PIN_I2S_DOUT);
                                 if(!i2s.begin(I2S_MODE_STD, 44100, I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_STEREO, I2S_STD_SLOT_BOTH)) {
                                   Serial.println("Failed to initialize I2S!");
                                   while(1) delay(100); // do nothing
                                 }
                                 if(DAC_ID == DAC_ID_PT8211) {
                                   i2s_std_config_t i2s_std_cfg;
                                   i2s_chan_handle_t h = i2s.txChan();
                                   i2s_channel_disable(h);
                                   i2s_std_cfg.slot_cfg = I2S_STD_MSB_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_STEREO);
                                   i2s_channel_reconfig_std_slot(h, &i2s_std_cfg.slot_cfg);
                                   i2s_channel_enable(h);
                                 }
                                 //_a2dp_sink = new BluetoothA2DPSink(i2s); // for some reason a dymamically a2dp_sink causes a reset loop
                                 static BluetoothA2DPSink a2dp_sink(i2s);   // so, we use a static vesion...
                                 _a2dp_sink = &a2dp_sink;
                                 { 
                              #else // Note: needs older version of AudioI2S
                                 _a2dp_sink = new BluetoothA2DPSink;
                                 if(_a2dp_sink == NULL)
                                   Serial.println("Error creating BluetoothA2DPSink");
                                 else {
                                   Serial.println("Initializing created");
                                   i2s_pin_config_t my_pin_config = {
                                     .mck_io_num   = I2S_PIN_NO_CHANGE,
                                     .bck_io_num   = PIN_I2S_BCK,
                                     .ws_io_num    = PIN_I2S_WS,
                                     .data_out_num = PIN_I2S_DOUT,
                                     .data_in_num  = I2S_PIN_NO_CHANGE
                                   };
                                   _a2dp_sink->set_pin_config(my_pin_config);
                                   #if DAC_ID == DAC_ID_PT8211
                                     i2s_config_t my_i2s_config = {
                                       .mode = (i2s_mode_t) (I2S_MODE_MASTER | I2S_MODE_TX),
                                       .sample_rate = 44100, // updated automatically by A2DP
                                       .bits_per_sample = (i2s_bits_per_sample_t)16,
                                       .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
                                       .communication_format = (i2s_comm_format_t) (I2S_COMM_FORMAT_STAND_MSB),
                                       .intr_alloc_flags = 0, // default interrupt priority
                                       .dma_buf_count = 8,
                                       .dma_buf_len = 64,
                                       .use_apll = true,
                                       .tx_desc_auto_clear = true // avoiding noise in case of data unavailability
                                     };
                                     _a2dp_sink->set_i2s_config(my_i2s_config);
                                   #endif 
                              #endif 
                                   _a2dp_sink->set_mono_downmix(Settings.NV.OutputFormat);                             
                                   _a2dp_sink->set_avrc_metadata_callback(avrc_metadata_callback);
                                   //_a2dp_sink->set_sample_rate_callback(sample_rate_callback);
                                   _a2dp_sink->set_on_volumechange(bt_volumechange);
                                   //_a2dp_sink->set_rssi_callback(rssi_callback);
                                   _a2dp_sink->set_raw_stream_reader(bt_raw_stream_reader);
                                   //_a2dp_sink->set_on_data_received(bt_on_data_received);
                                   _a2dp_sink->start((const char *)Settings.NV.BtName, true);
                                   _a2dp_sink->reconnect(); // OMT new
                                   //_a2dp_sink->set_volume(BLUETOOTH_VOLUME_MAX);
                                   Display.ShowHelpLine((const char *)Settings.NV.BtName);
                                 }
                                 _activity_counter = 0;
                                 break;
    case SET_SOURCE_WEB_RADIO  :{uint64_t timestamp_us = esp_timer_get_time();
                                 uint8_t  timeout = 25;
                                 Display.ShowHelpLine(DISPLAY_HELP_INITIALIZING_WEBRADIO, true);
                                 Display.Suspend();
                                 Serial.printf("Connecting to %s ", SsidSettings.GetSsid(Settings.NV.CurrentSsid), false);
                                 //WiFi.disconnect();
                                 WiFi.begin(SsidSettings.GetSsid(Settings.NV.CurrentSsid), SsidSettings.GetPassword(Settings.NV.CurrentSsid),1);
                                 //WiFi.connect(SsidSettings.GetSsid(Settings.NV.CurrentSsid), SsidSettings.GetPassword(Settings.NV.CurrentSsid));
                                 //WiFi.setTxPower((wifi_power_t)Settings.GetWifiTxLevel());
                                 //delay(100);
                                 //WiFi.disconnect();
                                 //delay(100);
                                 //WiFi.reconnect();
                                 while (WiFi.status() != WL_CONNECTED  && timeout > 0) {
                                   if( esp_timer_get_time() >= timestamp_us + 500000) {
                                      timestamp_us = esp_timer_get_time();
                                      timeout--;
                                      Serial.print(".");
                                   }
                                   // OMT: to do: Keep display running
                                 }
                                 if(WiFi.status() != WL_CONNECTED) {
                                   Serial.println(" CONNECTION FAILED");
                                   //Display.ShowHelpLine(DISPLAY_HELP_WIFI_CONNECT_FAILED, true);
                                   Display.Resume();
                                   Display.ShowWebRadioConnect(false);
                                   //Settings.WifiConnected = 0;
                                 }
                                 else {
                                   Serial.println(" CONNECTED");
                                   Display.Resume();
                                   if(Settings.Play)
                                     Display.ShowHelpLine(DISPLAY_HELP_WIFI_CONNECTED, true);
                                   else {
                                     if(Settings.NV.WebRadioTotalStations > 0)  
                                       Display.ShowHelpLine(DISPLAY_HELP_PRESS_PLAY_TO_START, true);
                                     else
                                       Display.ShowHelpLine(DISPLAY_HELP_URLS_FOUND, true);
                                     //Display.ShowHelpLine("PRESS_PLAY_TO_START", true);
                                   //Settings.WifiConnected = 1;
                                   }
                                 }
                                 _audio = new Audio;
                                 _audio->forceMono(Settings.NV.OutputFormat);
                                 _audio->setPinout(PIN_I2S_BCK, PIN_I2S_WS, PIN_I2S_DOUT);
                                 #if DAC_ID == DAC_ID_PT8211
                                   _audio->setI2SCommFMT_LSB(true);
                                   _audio->setVolume(SET_VOLUME_MAX);
                                 #else
                                   _audio->setVolume(SET_VOLUME_DEFAULT);
                                 #endif
                                 //Settings.InitDAC = 1;
                                }
                                break;
    
    case SET_SOURCE_WAVE_GEN   : _waveform_player = new SimpleWaveGeneratorClass;
                                 _waveform_player->Init();
                                 _waveform_player->Volume(Settings.GetLogVolume(WAVEFORM_VOLUME_MAX));
                                 break;
    default: break;
  }
  Display.ShowPlayer();
  SetVolume(Settings.NV.Volume);
  if(autoplay)
    Play();
//PrintChipInfo(0xC);
}

#ifdef SET_VOLUME_DEFAULT
void PlayerClass::SetVolume(int vol) {
  if(vol > Settings.NV.VolumeSteps) vol = Settings.NV.VolumeSteps;
  if(_audio != NULL)           _audio->setVolume(vol);
  if(_waveform_player != NULL) _waveform_player->Volume(Settings.GetLogVolume(WAVEFORM_VOLUME_MAX));
  if(_a2dp_sink != NULL)       _a2dp_sink->set_volume(Settings.GetLinVolume(BLUETOOTH_VOLUME_MAX));
  //if(Settings.NV.Volume != vol) {
  //Display.ShowVolume("12345678901234567");
    Display.ShowVolume();
    Settings.NV.Volume = vol;
  //}
}
#endif

void PlayerClass::Play(void) {
  switch(Settings.NV.SourceAF) {
    case SET_SOURCE_SD_CARD    : if(Settings.NoCard || Settings.NV.DiskTotalTracks == 0)
                                   break;
                                 else {
                                   if(Settings.FirstSong) {
                                     Serial.printf("OMT: DiskTrackResumePos %d, DiskTrackResumeTime %d\n", Settings.NV.DiskTrackResumePos, Settings.NV.DiskTrackResumeTime); 
                                     PlayTrackFromSD(Settings.NV.DiskCurrentTrack, Settings.NV.DiskTrackResumePos, Settings.NV.DiskTrackResumeTime, Settings.NV.DiskTrackTotalTime);
                                     Serial.printf("OMT: Current time %d\n", Settings.CurrentTrackTime); 
                                     Settings.FirstSong = 0;
                                   }
                                   else
                                     PlayTrackFromSD(Settings.NV.DiskCurrentTrack);
                                 }
                                 Settings.Play = 1;
                                 Display.ShowPlayPause(Settings.Play);
                                 Display.ShowPlayTime(true);
                                 Display.ShowTrackNumber();
                                 break;
    case SET_SOURCE_BLUETOOTH  : Settings.CurrentTrackTime = 0;
                                 Display.ShowBluetoothName();
                                 Settings.Play = 0; // omt
                                 Display.ShowPlayPause(0);
                                 break;
    case SET_SOURCE_WEB_RADIO  : if(Settings.NV.WebRadioTotalStations == 0) break;
                                 Settings.WebTitleReceived = 0;
                                 if(WiFi.isConnected()) {
                                   web_station_t web_station;
                                   UrlSettings.GetStation(Settings.NV.WebRadioCurrentStation, web_station);
                                   Serial.printf("**********start a new radio: %s\n",web_station.url);
                                   _audio->connecttohost(web_station.url);
                                   Serial.println("**********start a new radio************");
                                   Settings.AudioEnded = 0;
                                   Settings.Play = 1;
                                 }
                                 else
                                   Settings.Play = 0;
                                 Settings.CurrentTrackTime = 0;
                                 Display.ShowWebRadioNumber();
                                 Display.ShowPlayPause(Settings.Play);
                                 Display.ShowVolume(); // Show station name on volume line
                                 Serial.println("**********new radio started************");
                                 break;
    case SET_SOURCE_WAVE_GEN   : _waveform_player->Volume(Settings.GetLogVolume(WAVEFORM_VOLUME_MAX)); 
                                 _waveform_player->Start(Settings.NV.WaveformId);
                                 Settings.Play = 1;
                                 Settings.CurrentTrackTime = 0;
                                 _waveform_player->Resume();
                                 Display.ShowPlayPause();
                                 Display.ShowPlayTime();
                                 Display.ShowWaveformName(_waveform_player->GetWaveformName(Settings.NV.WaveformId));
                                 //Display.ShowTrackTitle("_waveform_player->GetWaveformName(Settings.NV.WaveformId)");  // OMT: ticker test
                                 Display.ShowWaveformId();
                                 break;
    default:                     break;
  }
}

IRAM_ATTR void PlayerClass::loop(bool ten_ms_tick, bool seconds_tick) {
  if(_audio != NULL) _audio->loop();
  switch(Settings.NV.SourceAF) {
    case SET_SOURCE_SD_CARD   :{  uint32_t t = _audio->getAudioCurrentTime(); // OMT + Settings.CurrentTrackTimeOffset;
                                  if(Settings.CurrentTrackTime != t) {
                                    if(t)
                                      Settings.CurrentTrackTime = t;
                                    t = _audio->getAudioFileDuration(); 
                                    if(t && Settings.TotalTrackTime != t) {
                                      Settings.TotalTrackTime = t; // Sometimes the total time updates after start
                                    }
                                    Display.ShowPlayTime(); //GuiUpdatePlayingTime();
                                    if(Settings.CurrentTrackTime > Settings.TotalTrackTime + 6) { // +6 for some tolerance
                                     Settings.AudioEnded = 1;
                                     _audio->stopSong(); // Somtimes the "audio_eof_mp3" is not generated, so force a stop
                                     audio_eof_mp3("time out on audio_eof_mp3");
                                   } 
                                 }
                               }
                                 if(Settings.AudioEnded)
                                   PlayNext();
                                 break;
    case SET_SOURCE_BLUETOOTH  : if(ten_ms_tick &&_activity_counter > 0) {
                                   _activity_counter--;
                                 }
                                 if(Settings.Play) {
                                   if(_activity_counter == 0 || _activity_sum == 0) {
                                     //Serial.printf("\n*** STOP %d,%d***\n", _activity_counter, _activity_sum);
                                     Settings.Play = 0; 
                                     Display.ShowPlayPause();
                                   }
                                 }
                                 else {
                                   if(_activity_counter > 0 && _activity_sum != 0) {
                                     //Serial.printf("\n*** PLAY %d,%d***\n", _activity_counter, _activity_sum);
                                     Settings.Play = 1; 
                                     Display.ShowPlayPause();
                                   }
                                 }
                                 if(seconds_tick) {
                                   CheckBluetoothVolume(_a2dp_sink->get_volume()); // a minimum volume is needed to run properly
                                   if(Settings.Play) {
                                     Settings.UpdateCurrentTrackTime();
                                     Display.ShowPlayTime();
                                   }
                                   if(!_a2dp_sink->is_connected() && _connected) {
                                      Display.ShowTrackTitle((const char *)Settings.NV.BtName);
                                   }
                                   _connected = _a2dp_sink->is_connected();
                                 }
                                 break;
    case SET_SOURCE_WEB_RADIO  : if(seconds_tick && _audio->isRunning()) {
                                   Settings.UpdateCurrentTrackTime();
                                   Display.ShowPlayTime();
                                   if(!Settings.WebTitleReceived && Settings.CurrentTrackTime == 2) { // Show the station name from list. 
                                     web_station_t web_station;
                                     UrlSettings.GetStation(Settings.NV.WebRadioCurrentStation, web_station);
                                     Display.ShowStationName(web_station.name);
                                   }
                                 }
                                 if(Settings.AudioEnded) 
                                   PlayNext();
                                 break;
    case SET_SOURCE_WAVE_GEN   : _waveform_player->loop();
                                 if(seconds_tick && Settings.Play) {
                                   Settings.UpdateCurrentTrackTime();
                                   Display.ShowPlayTime();
                                 }
                                 break;
    default:                     break;
  }
  Display.loop(ten_ms_tick); 
}

void PlayerClass::UpdateOutputFormat() {
   if( _audio != NULL) _audio->forceMono(Settings.NV.OutputFormat);
   if(_a2dp_sink != NULL) _a2dp_sink->set_mono_downmix(Settings.NV.OutputFormat);
}

void PlayerClass::PlayNew(void) {
  switch(Settings.NV.SourceAF) {
    case SET_SOURCE_SD_CARD    : Settings.NV.DiskCurrentTrack = Settings.NewTrack; Play(); break;
    case SET_SOURCE_WEB_RADIO  : Settings.NV.WebRadioCurrentStation = Settings.NewTrack; Play(); break;
    default: break;
  }  
}

