Gloeidraad/ESP32-MUSIC-PLAYER/Software/ESP32-Music-Player/Player.cpp
void PlayerClass::PlayNext(void) {
  switch(Settings.NV.SourceAF) {
    case SET_SOURCE_SD_CARD    : Settings.NextDiskTrack();    Play(); break;
    case SET_SOURCE_WEB_RADIO  : Settings.NextRadioStation(); Play(); break;
    case SET_SOURCE_BLUETOOTH  : _a2dp_sink->next();
                                 Settings.CurrentTrackTime = 0; 
                                 break; 
    case SET_SOURCE_WAVE_GEN   : Settings.NextWaveform();
                                 Play();
                                 break;
    default: break;
  }  
}

void PlayerClass::PlayPrevious(void) {
  switch(Settings.NV.SourceAF) {
    case SET_SOURCE_SD_CARD    : if(_audio->getAudioCurrentTime() >= 5) {
                                   //_audio->setTimeOffset(0);
                                   //Play();
                                   if(_audio->isRunning()) {
                                     _audio->pauseResume();
                                     Settings.CurrentTrackTime = 0;
                                     _audio->setAudioPlayPosition(0);
                                     Display.ShowPlayTime(true);
                                     _audio->pauseResume();
                                   }
                                   else {
                                     Settings.CurrentTrackTime = 0;
                                     _audio->setAudioPlayPosition(0);
                                     Display.ShowPlayTime(true);
                                   }
                                 }
                                 else {
                                   Settings.PrevDiskTrack();
                                   Play();
                                 }
                                 break;
    case SET_SOURCE_WEB_RADIO  : Settings.PrevRadioStation(); Play(); break;
    case SET_SOURCE_BLUETOOTH  : if(Settings.CurrentTrackTime >= 5) 
                                   _a2dp_sink->rewind();
                                 else
                                   _a2dp_sink->previous();
                                 Settings.CurrentTrackTime = 0;
                                 break;  
    case SET_SOURCE_WAVE_GEN   : Settings.PrevWaveform();
                                 Play();
                                 break;
    default: break;
  }
}

static void PrintSdDebug(Audio * _audio) {
  uint32_t t1,t2,t3;
  Serial.println("******************** Begin of SD pause debug"); 
  Serial.printf("getAudioDataStartPos: %d\n", _audio->getAudioDataStartPos()); 
  Serial.printf("getFileSize         : %d\n", _audio->getFileSize()); 
  Serial.printf("getFilePos          : %d\n", _audio->getFilePos()); 
  Serial.printf("getSampleRate       : %d\n", _audio->getSampleRate()); 
  Serial.printf("getBitsPerSample    : %d\n", _audio->getBitsPerSample()); 
  Serial.printf("getChannels         : %d\n", _audio->getChannels()); 
  Serial.printf("getBitRate          : %d\n", _audio->getBitRate()); 
  Serial.printf("getAudioFileDuration: %d\n", _audio->getAudioFileDuration()); 
  Serial.printf("getAudioCurrentTime : %d\n", _audio->getAudioCurrentTime()); 
  //Serial.printf("getTotalPlayingTime : %d\n", _audio->getTotalPlayingTime()); 
  //Serial.printf("getVUlevel          : %d\n", _audio->getVUlevel()); 
  Serial.printf("inBufferFilled      : %d\n", _audio->inBufferFilled()); 
  Serial.printf("inBufferFree        : %d\n", _audio->inBufferFree()); 
  //    Serial.printf("inBufferSize        : %d\n", _audio->inBufferSize()); 

  t1 = _audio->getFileSize() - _audio->getAudioDataStartPos();
  t2 = t1 * _audio->getAudioCurrentTime() / _audio->getAudioFileDuration();
  Serial.printf("OMT: Audio size     : %d\n", t1);
  Serial.printf("OMT: New file pos   : %d\n", t2);
   
  Serial.println("******************** End of SD pause debug"); 
}

void PlayerClass::PauseResume(void) {
  switch(Settings.NV.SourceAF) {
    case SET_SOURCE_SD_CARD    : if(Settings.NV.DiskTotalTracks == 0) break;
                                 Settings.Play = !_audio->isRunning();
                                 Serial.printf("PLAY/RESUME %d\n", (int)Settings.Play); 
                                 _audio->pauseResume();
                                 Display.ShowPlayPause(Settings.Play);
                                 if(!Settings.Play) {
                                   if(!Settings.NoCard && Settings.NV.DiskTotalTracks > 0) { 
                                     Serial.println("Save card track position");
                                     Settings.NV.DiskTrackResumeTime = _audio->getAudioCurrentTime();
                                     Settings.NV.DiskTrackResumePos  = _audio->getFilePos() - _audio->inBufferFilled();
                                     Settings.NV.DiskTrackTotalTime  = _audio->getAudioFileDuration();
                                     //Settings.NV.DiskTrackResumePos  = _audio->getAudioDataStartPos() + (_audio->getFileSize() - _audio->getAudioDataStartPos()) * Settings.NV.DiskTrackResumeTime / Settings.NV.DiskTrackTotalTime;
                                     Serial.printf("Saving pos: %d s, len: %d s\n", Settings.NV.DiskTrackResumeTime, Settings.NV.DiskTrackTotalTime); 
                                     PrintSdDebug(_audio);
                                     Settings.EepromStore();
                                   }
                                 }
                                 break;
    case SET_SOURCE_BLUETOOTH  : if(!Settings.Play) {
                                   _a2dp_sink->play();
                                   Display.ShowPlayPause(1);                                   
                                 }
                                 else {
                                   _a2dp_sink->pause();
                                   Display.ShowPlayPause(0);
                                 }
                                 break;
    case SET_SOURCE_WEB_RADIO  : if(Settings.NV.WebRadioTotalStations == 0) break;
                                 Settings.Play = !_audio->isRunning();
                                 _audio->pauseResume();
                                 Display.ShowPlayPause(Settings.Play);
                                 break;
    case SET_SOURCE_WAVE_GEN   : if(Settings.Play) {
                                   _waveform_player->Pause();
                                   Serial.println("--- WG pause ---");
                                 }
                                 else {
                                   _waveform_player->Resume();
                                   Serial.println("--- WG resume ---");
                                 }
                                 Settings.Play = !Settings.Play;
                                 Display.ShowPlayPause();
                                 break;
    default: break;
  }
}

