Gloeidraad/ESP32-MUSIC-PLAYER/Software/ESP32-Music-Player/Player.cpp
uint8_t PlayerClass::CheckBluetoothVolume(int v) {
  if(_a2dp_sink != NULL)  { 
    #if 0
      _a2dp_sink->set_volume(BLUETOOTH_VOLUME_MAX);
    #else
      if(v < BLUETOOTH_VOLUME_MIN) { // a minimum volume is needed to run properly
        v = BLUETOOTH_VOLUME_MIN;
        _a2dp_sink->set_volume(v);
        Serial.println("Bluetooth zero or low volume detected");
      }
      return v;
    #endif
  }
  return BLUETOOTH_VOLUME_MAX;
}

//******************************************************//
// optional functions                                   //
//******************************************************//

// optional (weak function override)

void audio_showstation(const char *info)     { Display.ShowStation(info);     }
void audio_showstreamtitle(const char *info) { Settings.WebTitleReceived = 1; Display.ShowStreamTitle(info); }
void audio_lasthost(const char *info)        { Display.ShowLastHost(info);    }
void audio_eof_mp3(const char *info)         { Display.ShowTrackEnded(info);  Settings.AudioEnded = 1; }
void audio_eof_stream(const char* info)      { Display.ShowStreamEnded(info); Settings.AudioEnded = 1; }

//#define SHOW_MORE_INFO

#ifdef SHOW_MORE_INFO
void audio_info(const char *info){
  Serial.print("info        "); Serial.println(info);
}

void audio_id3data(const char *info){  //id3 metadata
  Serial.print("id3data     ");Serial.println(info);
}

void audio_id3image(File& file, const size_t pos, const size_t size) { //ID3 metadata image
  Serial.println("icydescription");
}

void audio_icydescription(const char* info) {
  Serial.print("audio_icydescription");Serial.println(info);
}

#endif

void audio_commercial(const char *info) {  //duration in sec
  Serial.print("commercial  ");Serial.println(info);
}

void audio_showstreaminfo(const char *info) {
  Serial.print("streaminfo  "); Serial.println(info);
}

void audio_bitrate(const char *info) {
  Serial.print("bitrate     "); Serial.println(info);
}

void audio_icyurl(const char *info){  //homepage
  Serial.print("icyurl      ");Serial.println(info);
}

void audio_eof_speech(const char *info){
  Serial.print("eof_speech  ");Serial.println(info);
}
